Dlubal.RFEM5.ConnectionEccentricity
Connection eccentricity parameters

Dlubal.RFEM5.ConnectionEccentricity.No
Number

Dlubal.RFEM5.ConnectionEccentricity.ID
Identifier

Dlubal.RFEM5.ConnectionEccentricity.Comment
Comment

Dlubal.RFEM5.ConnectionEccentricity.Tag
Tag

Dlubal.RFEM5.ConnectionEccentricity.IsValid
Information if the object is valid or not (read only)

Dlubal.RFEM5.ConnectionEccentricity.IsGenerated
Information if the object is generated or not (read only)

Dlubal.RFEM5.ConnectionEccentricity.ReferenceSystem
Reference system

Dlubal.RFEM5.ConnectionEccentricity.Eccentricity
Eccentricity

Dlubal.RFEM5.ConnectionEccentricity.HorizontalAlignment
Horizontal cross-section alignment

Dlubal.RFEM5.ConnectionEccentricity.VerticalAlignment
Vertical cross-section alignment